package b_BigTusks.ConsoleTetris_2213;

public class Tmp9 {
    // Тетрис 9
    // в общем где-то в декабре 2018 мне дали задачу написать интеграцию между 1С и наше платформой.
    //я думал мне нужен такой-то метод и сразу писал его реализацию.
    //старший разработчик мне говорил
    //"ты сначала сядь подумай какие тебе методы нужны, напиши их в коде без реализации, просто оставь тело пустым, только объяви, потом потихонечку начнешь писать реализацию."
    //(это я примерно воспроизвел его речь, на самом деле там была речь на пол часа или час )
    //конечно я тогда, не понял что он имел ввиду.
    //уже после прочтения кучи разных статей я более менее врубаюсь что к чему.

    // сейчас посмотрев на текущий код в этой задачке и то как у нас устроен проект,
    //старший разработчик мне бы наверное сказал:
    //"уверен, что принцип SRP соблюден в классе Field?
    //может вынесешь методы print(), removeFullLines(), getValue(), setValue()?
    //скажем в класс FieldWorker?"
    //дальше была бы дискуссия, и там я бы либо отстоял свою позицию, либо
    //мне были приведены несокрушимые аргументы.

    // я к тому, что данная задача более менее отвечает на вопрос "как начать?"
    //само собой начинается все с листочка и ручки, обсуждением со старшим.
    //но потом садишься за код и все равно какой-то ступор.
    //а надо вот так просто прописать классы, переменные, пустые методы.
    //кажется это реально помогает, по кирпичику картинка в голове складывается и приходит большее понимание.
    //
    //в общем, я тут пытался что-то сказать, но на истину не претендую!
}
