package com.javarush.task.task37.task3702;

public class Tmp {
    // Фабрики (1)  паттерном Factory Method. Возьмем пример с людьми.
    //Будем определять, к какому типу относится человек в зависимости от его возраста.
    //В этом задании подготовим данные, которые будем использовать в фабрике.
    //1. Для всех типов людей создай общий интерфейс Human.
    //2. Будем делать Factory для мужчин. Для этого создай пакет male, в котором создай классы KidBoy, TeenBoy, Man.
    //Во всех этих классах реализуй интерфейс Human.
    //3. В каждом классе KidBoy, TeenBoy создай свою публичную константу MAX_AGE с соответствующими значениями: 12, 19.
    //
    //4. Сгенерируй автоматические методы toString для каждого класса KidBoy, TeenBoy, Man. Получится "KidBoy{}" и т.п.
    //
    //5. Создай класс Solution с методом main.
}
